vintagepc/MINI404/hw/arm/prusa/stm32_registers/generated/stm32h503/RCC_registers.h
typedef union {
	struct {
		uint32_t TIM2EN        : 1; 
		uint32_t TIM3EN        : 1; 
		uint32_t _reserved2    : 2;
		uint32_t TIM6EN        : 1; 
		uint32_t TIM7EN        : 1; 
		uint32_t _reserved6    : 5;
		uint32_t WWDGEN        : 1; 
		uint32_t _reserved12   : 1;
		uint32_t OPAMPEN       : 1; 
		uint32_t SPI2EN        : 1; 
		uint32_t SPI3EN        : 1; 
		uint32_t COMPEN        : 1; 
		uint32_t USART2EN      : 1; 
		uint32_t USART3EN      : 1; 
		uint32_t _reserved19   : 2;
		uint32_t I2C1EN        : 1; 
		uint32_t I2C2EN        : 1; 
		uint32_t I3C1EN        : 1; 
		uint32_t CRSEN         : 1; 
		uint32_t _reserved25   : 7;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(h503_rcc,apb1lenr);
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_rcc,apb1lenr),bits);

typedef union {
	struct {
		uint32_t _reserved0    : 3;
		uint32_t DTSEN         : 1; 
		uint32_t _reserved4    : 1;
		uint32_t LPTIM2EN      : 1; 
		uint32_t _reserved6    : 3;
		uint32_t FDCANEN       : 1; 
		uint32_t _reserved10   :22;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(h503_rcc,apb1henr);
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_rcc,apb1henr),bits);

typedef union {
	struct {
		uint32_t _reserved0    :11;
		uint32_t TIM1EN        : 1; 
		uint32_t SPI1EN        : 1; 
		uint32_t _reserved13   : 1;
		uint32_t USART1EN      : 1; 
		uint32_t _reserved15   : 9;
		uint32_t USBEN         : 1; 
		uint32_t _reserved25   : 7;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(h503_rcc,apb2enr);
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_rcc,apb2enr),bits);

typedef union {
	struct {
		uint32_t _reserved0    : 1;
		uint32_t SBSEN         : 1; 
		uint32_t _reserved2    : 4;
		uint32_t LPUART1EN     : 1; 
		uint32_t _reserved7    : 2;
		uint32_t I3C2EN        : 1; 
		uint32_t _reserved10   : 1;
		uint32_t LPTIM1EN      : 1; 
		uint32_t _reserved12   : 9;
		uint32_t RTCAPBEN      : 1; 
		uint32_t _reserved22   :10;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(h503_rcc,apb3enr);
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_rcc,apb3enr),bits);

typedef union {
	struct {
		uint32_t GPDMA1LPEN    : 1; 
		uint32_t GPDMA2LPEN    : 1; 
		uint32_t _reserved2    : 6;
		uint32_t FLITFLPEN     : 1; 
		uint32_t _reserved9    : 3;
		uint32_t CRCLPEN       : 1; 
		uint32_t _reserved13   : 4;
		uint32_t RAMCFGLPEN    : 1; 
		uint32_t _reserved18   : 6;
		uint32_t TZSC1LPEN     : 1; 
		uint32_t _reserved25   : 3;
		uint32_t BKPRAMLPEN    : 1; 
		uint32_t ICACHELPEN    : 1; 
		uint32_t _reserved30   : 1;
		uint32_t SRAM1LPEN     : 1; 
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(h503_rcc,ahb1lpenr);
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_rcc,ahb1lpenr),bits);

typedef union {
	struct {
		uint32_t GPIOALPEN     : 1; 
		uint32_t GPIOBLPEN     : 1; 
		uint32_t GPIOCLPEN     : 1; 
		uint32_t GPIODLPEN     : 1; 
		uint32_t _reserved4    : 3;
		uint32_t GPIOHLPEN     : 1; 
		uint32_t _reserved8    : 2;
		uint32_t ADCLPEN       : 1; 
		uint32_t DAC1LPEN      : 1; 
		uint32_t _reserved12   : 5;
		uint32_t HASHLPEN      : 1; 
		uint32_t RNGLPEN       : 1; 
		uint32_t _reserved19   :11;
		uint32_t SRAM2LPEN     : 1; 
		uint32_t _reserved31   : 1;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(h503_rcc,ahb2lpenr);
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_rcc,ahb2lpenr),bits);

typedef union {
	struct {
		uint32_t TIM2LPEN      : 1; 
		uint32_t TIM3LPEN      : 1; 
		uint32_t _reserved2    : 2;
		uint32_t TIM6LPEN      : 1; 
		uint32_t TIM7LPEN      : 1; 
		uint32_t _reserved6    : 5;
		uint32_t WWDGLPEN      : 1; 
		uint32_t _reserved12   : 1;
		uint32_t OPAMPLPEN     : 1; 
		uint32_t SPI2LPEN      : 1; 
		uint32_t SPI3LPEN      : 1; 
		uint32_t COMPLPEN      : 1; 
		uint32_t USART2LPEN    : 1; 
		uint32_t USART3LPEN    : 1; 
		uint32_t _reserved19   : 2;
		uint32_t I2C1LPEN      : 1; 
		uint32_t I2C2LPEN      : 1; 
		uint32_t I3C1LPEN      : 1; 
		uint32_t CRSLPEN       : 1; 
		uint32_t _reserved25   : 7;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(h503_rcc,apb1llpenr);
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_rcc,apb1llpenr),bits);

typedef union {
	struct {
		uint32_t _reserved0    : 3;
		uint32_t DTSLPEN       : 1; 
		uint32_t _reserved4    : 1;
		uint32_t LPTIM2LPEN    : 1; 
		uint32_t _reserved6    : 3;
		uint32_t FDCANLPEN     : 1; 
		uint32_t _reserved10   :22;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(h503_rcc,apb1hlpenr);
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_rcc,apb1hlpenr),bits);

typedef union {
	struct {
		uint32_t _reserved0    :11;
		uint32_t TIM1LPEN      : 1; 
		uint32_t SPI1LPEN      : 1; 
		uint32_t _reserved13   : 1;
		uint32_t USART1LPEN    : 1; 
		uint32_t _reserved15   : 9;
		uint32_t USBLPEN       : 1; 
		uint32_t _reserved25   : 7;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(h503_rcc,apb2lpenr);
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_rcc,apb2lpenr),bits);

typedef union {
	struct {
		uint32_t _reserved0    : 1;
		uint32_t SBSLPEN       : 1; 
		uint32_t _reserved2    : 4;
		uint32_t LPUART1LPEN   : 1; 
		uint32_t _reserved7    : 2;
		uint32_t I3C2LPEN      : 1; 
		uint32_t _reserved10   : 1;
		uint32_t LPTIM1LPEN    : 1; 
		uint32_t _reserved12   : 9;
		uint32_t RTCAPBLPEN    : 1; 
		uint32_t _reserved22   :10;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(h503_rcc,apb3lpenr);
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_rcc,apb3lpenr),bits);

typedef union {
	struct {
		uint32_t USART1SEL     : 3; 
		uint32_t USART2SEL     : 3; 
		uint32_t USART3SEL     : 3; 
		uint32_t _reserved9    :22;
		uint32_t TIMICSEL      : 1; 
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(h503_rcc,ccipr1);
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_rcc,ccipr1),bits);

typedef union {
	struct {
		uint32_t _reserved0    : 8;
		uint32_t LPTIM1SEL     : 3; 
		uint32_t _reserved11   : 1;
		uint32_t LPTIM2SEL     : 3; 
		uint32_t _reserved15   :17;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(h503_rcc,ccipr2);
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_rcc,ccipr2),bits);

typedef union {
	struct {
		uint32_t SPI1SEL       : 3; 
		uint32_t SPI2SEL       : 3; 
		uint32_t SPI3SEL       : 3; 
		uint32_t _reserved9    :15;
		uint32_t LPUART1SEL    : 3; 
		uint32_t _reserved27   : 5;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(h503_rcc,ccipr3);
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_rcc,ccipr3),bits);

